Da/app/controllers/comments_controller.rb

  def create

    @post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    #@comment.user_id = current_user.id
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("text", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "deer"], ["post_id", 1], ["user_id", 1], ["created_at", "2015-04-20 15:53:28.235984"], ["updated_at", "2015-04-20 15:53:28.235984"]]