Da/app/controllers/posts_controller.rb

  def show
    @user = Post.find(params[:id])
    @comments = @user.comments.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [[nil, 1]]

  def create
    @post = Post.new(post_params)
    @post.autor = current_user.email
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "autor", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ffffd"], ["autor", "da@da.fr"], ["text", "dfsf"], ["user_id", 2], ["created_at", "2015-04-13 21:39:56.989086"], ["updated_at", "2015-04-13 21:39:56.989086"]]