Da/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "LooK\r\n"], ["user_id", 1], ["created_at", "2015-04-13 21:10:36.489010"], ["updated_at", "2015-04-13 21:10:36.489010"]]