Da/app/controllers/weathers_controller.rb

  def index
    @weathers = Weather.all
---
SELECT "weathers".* FROM "weathers"

  def create
    @weather = Weather.new(weather_params)
    @weather.user_id = current_user.id

    respond_to do |format|
      if @weather.save
---
INSERT INTO "weathers" ("city", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", "Bordeaux"], ["country", "France"], ["created_at", "2015-04-15 07:54:00.869137"], ["updated_at", "2015-04-15 07:54:00.869137"]]

  def update
    respond_to do |format|
      if @weather.update(weather_params)
---
UPDATE "weathers" SET "city" = ?, "updated_at" = ? WHERE "weathers"."id" = ?  [["city", "Le Havre"], ["updated_at", "2015-04-15 23:53:44.695173"], ["id", 2]]

    def set_weather
      @weather = Weather.find(params[:id])
---
SELECT  "weathers".* FROM "weathers" WHERE "weathers"."id" = ? LIMIT 1  [["id", 2]]