MyPage/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "autor", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sss"], ["autor", "sss"], ["text", "ssss"], ["created_at", "2015-03-07 13:14:01.285794"], ["updated_at", "2015-03-07 13:14:01.285794"]]