MyPage/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "dodo\r\n"], ["created_at", "2015-03-21 15:21:38.191684"], ["updated_at", "2015-03-21 15:21:38.191684"]]

    def set_task
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]