MyPage/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Da"], ["email", "ba@g.com"], ["password", "mas"], ["created_at", "2015-03-06 09:12:56.908762"], ["updated_at", "2015-03-06 09:12:56.908762"]]