Da/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [[nil, 1]]
---
    <h2>Comments</h2>
    <% @post.comments.each do |comment| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
	<blockquote>
	  <% @user = User.find(1) %>